Revit 2024 API
BuiltInFailures.ZoneFailures.ZoneNotEnclosed Property
 Zone not enclosed totally.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ZoneNotEnclosed { get; }
Visual Basic
Public Shared ReadOnly Property ZoneNotEnclosed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ZoneNotEnclosed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace